; domain
(define (domain Light-Up-Domain)
    (:requirements :adl :typing)
    (:types xpos ypos num - object)
    (:predicates    (increment ?n1 ?n2 - num)
                    (adjacent ?x1 - xpos ?y1 - ypos ?x2 - xpos ?y2 - ypos)
                    (right ?x1 ?x2 - xpos)
                    (left ?x1 ?x2 - xpos)
                    (up ?y1 ?y2 - ypos)
                    (below ?y1 ?y2 - ypos)
                    (lit ?x - xpos ?y - ypos)
                    (black ?x1 - xpos ?y1 - ypos)
                    (surrounded ?x1 - xpos ?y1 - ypos ?n - num)
    )
    
    (:action light-up
        :parameters (?x - xpos ?y - ypos)
        :precondition (and
            (not (lit ?x ?y))
            (not (black ?x ?y))
        )
        :effect (and
            ; RIGHT
            (forall (?x2 - xpos) 
                (when 
                    (and 
                        (right ?x2 ?x) 
                        (not (exists (?xb - xpos) (and (black ?xb ?y) (right ?xb ?x) (left ?xb ?x2)) ))
                    )
                    (lit ?x2 ?y)
                )
            )
            ; LEFT
            (forall (?x2 - xpos) 
                (when 
                    (and 
                        (left ?x2 ?x) 
                        (not (exists (?xb - xpos) (and (black ?xb ?y) (left ?xb ?x) (right ?xb ?x2)) ))
                    )
                    (lit ?x2 ?y)
                )
            )
            ; UP
            (forall (?y2 - ypos) 
                (when 
                    (and 
                        (up ?y2 ?y) 
                        (not (exists (?yb - ypos) (and (black ?x ?yb) (up ?yb ?y) (below ?yb ?y2)) ))
                    )
                    (lit ?x ?y2)
                )
            )
            ; DOWN
            (forall (?y2 - ypos) 
                (when 
                    (and 
                        (below ?y2 ?y) 
                        (not (exists (?yb - ypos) (and (black ?x ?yb) (below ?yb ?y) (up ?yb ?y2)) ))
                    )
                    (lit ?x ?y2)
                )
            )
            (forall (?x2 - xpos ?y2 - ypos ?n1 ?n2 - num) 
                (when (and
                        (adjacent ?x ?y ?x2 ?y2)
                        (black ?x2 ?y2)
                        (increment ?n1 ?n2)
                        (surrounded ?x2 ?y2 ?n1)
                      )
                      (and
                          (not (surrounded ?x2 ?y2 ?n1))
                          (surrounded ?x2 ?y2 ?n2)
                      )
                )
            )
            (lit ?x ?y)
        )
    )
    
)

; problem
(define (problem Light-Up-Problem)
    (:domain Light-Up-Domain)
    (:objects 
        N0 N1 N2 N3 N4 - num
		X0 - xpos
		Y0 - ypos
		X1 - xpos
		Y1 - ypos
		X2 - xpos
		Y2 - ypos
		X3 - xpos
		Y3 - ypos
		X4 - xpos
		Y4 - ypos

    )
    (:init 
        (increment N0 N1)
        (increment N1 N2)
        (increment N2 N3)
        (increment N3 N4)
		(adjacent X0 Y0 X1 Y0)
		(adjacent X0 Y0 X0 Y1)
		(adjacent X0 Y1 X0 Y0)
		(adjacent X0 Y1 X1 Y1)
		(adjacent X0 Y1 X0 Y2)
		(adjacent X0 Y2 X0 Y1)
		(adjacent X0 Y2 X1 Y2)
		(adjacent X0 Y2 X0 Y3)
		(adjacent X0 Y3 X0 Y2)
		(adjacent X0 Y3 X1 Y3)
		(adjacent X0 Y3 X0 Y4)
		(adjacent X0 Y4 X0 Y3)
		(adjacent X0 Y4 X1 Y4)
		(adjacent X1 Y0 X0 Y0)
		(adjacent X1 Y0 X2 Y0)
		(adjacent X1 Y0 X1 Y1)
		(adjacent X1 Y1 X0 Y1)
		(adjacent X1 Y1 X1 Y0)
		(adjacent X1 Y1 X2 Y1)
		(adjacent X1 Y1 X1 Y2)
		(adjacent X1 Y2 X0 Y2)
		(adjacent X1 Y2 X1 Y1)
		(adjacent X1 Y2 X2 Y2)
		(adjacent X1 Y2 X1 Y3)
		(adjacent X1 Y3 X0 Y3)
		(adjacent X1 Y3 X1 Y2)
		(adjacent X1 Y3 X2 Y3)
		(adjacent X1 Y3 X1 Y4)
		(adjacent X1 Y4 X0 Y4)
		(adjacent X1 Y4 X1 Y3)
		(adjacent X1 Y4 X2 Y4)
		(adjacent X2 Y0 X1 Y0)
		(adjacent X2 Y0 X3 Y0)
		(adjacent X2 Y0 X2 Y1)
		(adjacent X2 Y1 X1 Y1)
		(adjacent X2 Y1 X2 Y0)
		(adjacent X2 Y1 X3 Y1)
		(adjacent X2 Y1 X2 Y2)
		(adjacent X2 Y2 X1 Y2)
		(adjacent X2 Y2 X2 Y1)
		(adjacent X2 Y2 X3 Y2)
		(adjacent X2 Y2 X2 Y3)
		(adjacent X2 Y3 X1 Y3)
		(adjacent X2 Y3 X2 Y2)
		(adjacent X2 Y3 X3 Y3)
		(adjacent X2 Y3 X2 Y4)
		(adjacent X2 Y4 X1 Y4)
		(adjacent X2 Y4 X2 Y3)
		(adjacent X2 Y4 X3 Y4)
		(adjacent X3 Y0 X2 Y0)
		(adjacent X3 Y0 X4 Y0)
		(adjacent X3 Y0 X3 Y1)
		(adjacent X3 Y1 X2 Y1)
		(adjacent X3 Y1 X3 Y0)
		(adjacent X3 Y1 X4 Y1)
		(adjacent X3 Y1 X3 Y2)
		(adjacent X3 Y2 X2 Y2)
		(adjacent X3 Y2 X3 Y1)
		(adjacent X3 Y2 X4 Y2)
		(adjacent X3 Y2 X3 Y3)
		(adjacent X3 Y3 X2 Y3)
		(adjacent X3 Y3 X3 Y2)
		(adjacent X3 Y3 X4 Y3)
		(adjacent X3 Y3 X3 Y4)
		(adjacent X3 Y4 X2 Y4)
		(adjacent X3 Y4 X3 Y3)
		(adjacent X3 Y4 X4 Y4)
		(adjacent X4 Y0 X3 Y0)
		(adjacent X4 Y0 X4 Y1)
		(adjacent X4 Y1 X3 Y1)
		(adjacent X4 Y1 X4 Y0)
		(adjacent X4 Y1 X4 Y2)
		(adjacent X4 Y2 X3 Y2)
		(adjacent X4 Y2 X4 Y1)
		(adjacent X4 Y2 X4 Y3)
		(adjacent X4 Y3 X3 Y3)
		(adjacent X4 Y3 X4 Y2)
		(adjacent X4 Y3 X4 Y4)
		(adjacent X4 Y4 X3 Y4)
		(adjacent X4 Y4 X4 Y3)
		(right X1 X0)
		(left X0 X1)
		(up Y0 Y1)
		(below Y1 Y0)
		(right X2 X0)
		(left X0 X2)
		(up Y0 Y2)
		(below Y2 Y0)
		(right X2 X1)
		(left X1 X2)
		(up Y1 Y2)
		(below Y2 Y1)
		(right X3 X0)
		(left X0 X3)
		(up Y0 Y3)
		(below Y3 Y0)
		(right X3 X1)
		(left X1 X3)
		(up Y1 Y3)
		(below Y3 Y1)
		(right X3 X2)
		(left X2 X3)
		(up Y2 Y3)
		(below Y3 Y2)
		(right X4 X0)
		(left X0 X4)
		(up Y0 Y4)
		(below Y4 Y0)
		(right X4 X1)
		(left X1 X4)
		(up Y1 Y4)
		(below Y4 Y1)
		(right X4 X2)
		(left X2 X4)
		(up Y2 Y4)
		(below Y4 Y2)
		(right X4 X3)
		(left X3 X4)
		(up Y3 Y4)
		(below Y4 Y3)

		(black X4 Y1)
		(surrounded X4 Y1 N0)

		(black X4 Y2)
		(surrounded X4 Y2 N0)

		(black X3 Y3)
		(surrounded X3 Y3 N0)

		(black X1 Y3)
		(surrounded X1 Y3 N0)

		(black X0 Y3)
 
    )
    (:goal ( and 
        (
            forall (?x - xpos ?y - ypos)(or (black ?x ?y) (lit ?x ?y))
        )
		(surrounded X4 Y1 N0)
		(surrounded X4 Y2 N1)
		(surrounded X3 Y3 N3)
		(surrounded X1 Y3 N1)
    ))
)

; plan
1. (light-up x0 y2)
   added: (lit x1 y2) (lit x2 y2) (lit x3 y2) (lit x4 y2) (lit x0 y0) (lit x0 y1) (lit x0 y3) (lit x0 y2)
   goals met: 1 of 5
2. (light-up x1 y1)
   added: (lit x2 y1) (lit x3 y1) (lit x4 y1) (lit x1 y0) (lit x1 y3) (lit x1 y1)
   goals met: 1 of 5
3. (light-up x2 y3)
   deleted: (surrounded x1 y3 n0) (surrounded x3 y3 n0)
   added: (lit x3 y3) (lit x2 y0) (lit x2 y4) (surrounded x1 y3 n1) (surrounded x3 y3 n1) (lit x2 y3)
   goals met: 2 of 5
4. (light-up x3 y0)
   added: (lit x4 y0) (lit x3 y0)
   goals met: 2 of 5
5. (light-up x3 y4)
   deleted: (surrounded x3 y3 n1)
   added: (lit x4 y4) (lit x0 y4) (lit x1 y4) (surrounded x3 y3 n2) (lit x3 y4)
   goals met: 2 of 5
6. (light-up x4 y3)
   deleted: (surrounded x3 y3 n2) (surrounded x4 y2 n0)
   added: (surrounded x3 y3 n3) (surrounded x4 y2 n1) (lit x4 y3)
   goals met: 5 of 5
